[
    [
        0.6720820069313049,
        "What is Financial Function? Objectives & Importance of Finance Functions - Management Study HQ Skip to content Menu Management Process Management Basics Management Theories Marketing Distribution Management Product Management Sales Management International Marketing Human Resource Organizational Behaviour Communication Decision Making Group Behavior Leadership Motivation Organization Management Personality Pricing Operations Customer Relationship Management Supply Chain Management Definition of Finance Functions The Finance Function is a part of financial management. Financial Management is the activity concerned with the control and planning of financial resources. In business, the finance function involves the acquiring and utilization of funds necessary for efficient operations. Finance is the lifeblood of business without it things wouldnt run smoothly. It is the source to run any organization, it provides the money, it acquires the money. The Finance function has been classified into three: Long-Term Finance This includes finance of investment 3 years or more. Sources of long-term finance include owner capital, share capital, long-term loans, debentures, internal funds and so on. Medium Term Finance This is financing done between 1 to 3 years, this can be sourced from bank loans and financial institutions. Short Term Finance  This is finance needed below one year. Funds may be acquired from bank overdrafts, commercial paper, advances from customers, trade credit etc. See also Organization Management - Meaning, Need and its FeaturesObjectives of Finance Functions Investment Decisions This is where the finance manager decides where to put the company funds. Investment decisions relating to the management of working capital, capital budgeting decisions, management of mergers, buying or leasing of assets. Investment decisions should create revenue, profits and save costs. Financing Decisions Here a company decides where to raise funds from. They are two main sources to consider mainly equity and borrowed. From the two a decision on the appropriate mix of short and long-term financing should be made. The sources of financing best at a given time should also be agreed upon. Dividend Decisions These are decisions as to how much, how frequent and in what form to return cash to owners. A balance between profits retained and the amount paid out as dividends should be decided here. Liquidity Decisions Liquidity means that a firm has enough money to pay its bills when they are due and have sufficient cash reserves to meet unforeseen emergencies. This decision involves the management of the current assets so you dont become insolvent or fail to make payments. Why a Business Needs The Finance Functions Helps Establish a Business Without money, you cannot get labor, land and so on with the finance function you can determine what is required to start your business and plan for it. Helps Run a Business To remain in business you must cater to the day to day operating costs such as paying salaries, buying stationery, raw material, the finance function ensures you always have adequate funds to cater to this. To Expand, Modernize, Diversify A business needs to grow otherwise it may become redundant in no time. With the finance function, you can determine and acquire the funds required to do so. Purchase Assets-You need money to purchase assets. This can be tangible assets like furniture, buildings or intangible like trademarks, patents, etc. to get this you need finances. See also What is Unemployment and What are Various Types of Unemployment?Importance of Finance Functions Identify Need of Finance-To starts a business you need to know how much is required to open it. So, the finance function helps you know how much the initial capital is, how much of it you have and how much you need to raise. Identify Sources of Finance-Once you know what needs to be raised you look at areas you can raise these funds from. You can borrow or get from various shareholders. Comparison of Various Sources of Finance After identifying various fund sources compare the cost and risk involved. Then choose the best source of financing that suits your business needs. Investment-Once the funds are raised it is time to invest them. Investment decisions should be done in a manner that a business gets higher returns. Cost of funds procurement should be lower than the return on investment, this will show a wise investment was made. The Finance Function Involves Ensure enough funds at a reasonable cost. Ensure the safety of funds. Ensure efficient effective and profitable utilization of funds. Ensure that finance funds dont remain idle. About Sonia Kukreja I am a mother of a lovely kid, and an avid fan technology, computing and management related topics. I hold a degree in MBA from well known management college in India. After completing my post graduation I thought to start a website where I can share management related concepts with rest of the people.",
        "https://www.managementstudyhq.com/financial-function-types-importance-objectives.html"
    ],
    [
        0.530943751335144,
        "In the short term, leaders need to address concerns surrounding the workplace of the future, and in the long term, adopt new ways of working. Innovation and collaboration Creativity and innovation are the keys to success and both are only possible with collaboration. Way forward Here are six key actions for finance functions to consider: Redefine the focus of finance to include broader performance metrics for natural and human capital. Invest in technologies that can be used to create an support an enterprise-wide data model. Use predictive analytics based upon this model to drive more holistic business decision-making. Enhance business partnering and analytical skills to ensure that finance can fulfil this new role across the organisation and continue to improve collaboration both across it and with external parties. Drive for greater efficiency, productivity and standardisation across processes and common platforms. Through these actions, establish finance as the central point within the organisation for achieving sustainable and responsible growth and enhancing the reputation of the organisation. Finance functions are confronting a new set of challenges amidst the pandemic. With the heightened focus on ESG, traditional views of profit maximisation no longer cut it. Investing in data and technology is the way forward. A rethink of skills and talent needs is in order, reinforced by a culture of innovation and collaboration. Razman Adam ZainudinPartner, Finance Transformation, PwC Malaysia About the report In the joint research conducted by PwC and ACCA, we draw insights from several interviews and virtual roundtables conducted in April 2021 and a survey of ACCA members and affiliates, PwC contacts, and various chief financial officers (CFOs) to delve into how the finance function in SEA has been impacted by COVID-19 and the factors that organisations must consider in order for their finance function to remain relevant. Find out more about the global insight Download Download the Malaysia infographics Read the SEA report to find out how finance functions can capitalise on the current opportunities Contact us Razman Adam Zainudin Partner, Finance Transformation, PwC Malaysia Tel: +60 (3) 2173 0225 Email Follow us Today's issues Budget Trust Sustainability and Climate Change New World. New Skills. Insights Our Perspective Blog Accounting & Capital Markets Updates Publications PwC Insights TaXavvy Subscription Centre Industries Financial Services Government and Public Sector Oil and Gas Technology, Media and Telecommunications Our services Assurance Consulting Deals Digital Services Entrepreneurial and Private Business PwC's Academy PwC's Asia Pacific Marketplace Risk Services Tax About us Alumni Network Annual Report Corporate Sustainability Diversity & Inclusion Hall of Fame Media Centre Our Leadership Team Third Party Code of Conduct Transparency Report Contact Us Careers Career Opportunities Experienced Careers Graduates and Non-graduates Internships Work-life @ PwC Malaysia  2018 - 2024 PwC. All rights reserved. PwC refers to the PwC network and/or one or more of its member firms, each of which is a separate legal entity. Please see www.pwc.com/structure for further details. Privacy statement Legal disclaimer Cookie information About site provider Site map",
        "https://www.pwc.com/my/en/publications/2021/finance-functions.html"
    ],
    [
        0.48871031403541565,
        "Transforming to the finance function of the future | McKinsey Skip to main contentFinance 2030: Four imperatives for the next decadeNovember 17, 2020 | Article Ankur Agrawal Steven Eklund Josh Waite Ed WoodcockOver the past decade, finance departments reduced costs by almost 30 percent. The next decades focus: achieving even higher levels of effectiveness. (7 pages) The trade-off between cost reduction and increased effectiveness of the finance function is a false choice. Leading finance departments are guardians of enterprise value creation, demonstrating stewardship of their own spend by lowering absolute costs and shifting work towards more value-added activities. We have analyzed the finance functions of hundreds of companies to understand how cost and effectiveness have evolved over the past ten years. After controlling for differences in sector, scale, and geographic footprint, several findings emerged: Finance organizations have, on average, decreased their cost by 29 percent. The most efficient cohort of finance departments (finance leaders) achieved similar cost improvement to the level shown by average performersan impressive feat given that the finance leaders started from a lower cost base. Finance leaders spent 19 percent more time on value-added (versus transaction-processing) activities than a typical finance department did. What can companies do differently to join the finance leaders? The research points toward four imperatives. The first is to cast a wider net for new efficiency opportunities, reaching beyond the transactional activities that have long been the primary focus of attention. Second, boost finances role in managing data, whether consolidating, simplifying, or controlling the flood of information flowing across the organization. Third, strengthen decision-making through widespread adoption of data-visualization, advanced-analytics, and debiasing techniques. Finally, reimagine the finance operating model so that it fosters new skills and capabilities. These steps are already enabling companies to join the finance-function elitewhile cutting audit costs by double-digit percentages, improving data quality (and reducing wasteful data-cleaning efforts), upskilling finance teams, and enabling the function to guide better decisions throughout the enterprise. A decade of efficiency gains While the magnitude of improvement varied among sectors, ranging from 15 to 35 percent over the ten-year period, the decline in the cost of finance departments is consistent across industries (Exhibit 1). 1 More significant, however, were the gains among the finance leaders, whose improvement rate was slightly higher (26 percent versus 25 percent) despite a leaner starting pointdemonstrating the value of continuing to focus on finance-function efficiency regardless of previous gains. Finance leaders further differentiate themselves by spending a greater portion of their time on value-added activities, such as financial planning and analysis (FP&A), strategic planning, treasury, operational-risk management, and policy setting. Todays finance leaders spend 19 percent more of total finance-staff bandwidth on value-added activities than the average company did ten years ago (Exhibit 2). This prioritization enables finance leaders to build deeper capabilities in value-additive areas, creating a positive feedback loop that could result in even greater advantages in the future. 2 The finance department of the future Achieving the next frontier in finance efficiency and effectiveness will likely require finance executives to shift their thinking from the priorities of the past. Four moves are especially critical for delivering greater real-time insights, minimizing human error and biases, and driving speed in workflows and decision-making. Imperative #1: Look beyond transactional activities Many leading organizations have substantially increased efficiency in transactional functionsby 39 percent or moreincluding areas such as accounts payable, accounts receivable, and other core accounting areas. While most companies have room for further improvement, subsequent efficiency efforts will almost inevitably show diminishing returns as the cost base for these activities continues to shrink. In contrast, our research found fewer efficiency improvements in the more strategic areas of finance, such as FP&A, optimizing capital structures, tax planning, controllership, internal audit, and financial-risk management. This appears likely to change. With advances in computing power, machine learning and artificial intelligence (AI) can increasingly be applied to complex tasks, building on the lead started by robotic process automation (RPA) and similar technologies that are used to automate transactional activities. One high-tech manufacturer is now using machine-learning algorithms and analytics to monitor financial and business-continuity risks. These technologies have allowed audits to focus on the units that pose the greatest risks, and to reduce staff time needed to complete each audit. As a result, the manufacturer has reduced the total cost of internal audits by 15 to 20 percent. Likewise, a global consumer-package-goods company used natural-language generation (NLG) to provide an initial draft of the management discussion and analysis for its monthly operational review.",
        "https://www.mckinsey.com/capabilities/operations/our-insights/finance-2030-four-imperatives-for-the-next-decade"
    ],
    [
        0.46109604835510254,
        "Ideally, each decision entails making the optimal trade-off of resourcesamong business units, between business units and functions, and among functionsto fulfill this purpose. The custodian seeks to solve this multidimensional problem of resource allocation holistically. Although focusing on the corporate purpose increases the complexity of decision making, the payoff in terms of business impact is significant.To steer performance based on the corporate purpose, CFOs need to broaden their perspective beyond traditional financials. For example, sustainability and societal impact have become increasingly important considerations. CFOs can integrate these topicsoften referred to as environmental, social, and governance (ESG) factorsinto performance steering. This extends well beyond the disclosure requirements and investor expectations that CFOs have typically considered in connection with ESG.The Four Enablers Four enablers support the finance function as the custodian of performance.Hybrid Finance FunctionIt is clear that digitization is fundamentally disrupting finance. In their initial applications of digital, companies seek to reduce manual work by standardizing, optimizing, and almost fully automating their main finance processes from end to end. At the same time, they improve the availability and accessibility of data. Most companies have already embarked on this stage of the journey.After mastering the first stage, finance organizations should move toward hybrid financea symbiosis of finance specialists and the digital ecosystem that includes artificial intelligence, machine learning, and advanced analytics. By integrating finance employees and digital capabilities, the finance function can use the digital ecosystem not only to promote efficiency, but also to perform value-adding tasks. In our view, every CFOs agenda should include evolving from efficiency-focused digitization to hybrid finance.Examples of how hybrid finance delivers value include:Providing initial hypotheses on the appropriate actions to take based on data-driven insights and pinpointing important questions to ask.Performing independent tasks (such as hedging) that do not entail repetitive work or clear rules.Conducting complex simulations relating to, for example, the interrelationships among cash, taxes, and the balance sheet. Hybrid finance also creates new roles in the finance function, as finance employees need to administer the digital ecosystem and perform sanity checks to ensure the quality of, for example, forecasts and simulations.Organization as a Living SystemThe finance function needs a fundamentally new operating model to support the custodian of performance. The end-to-end optimization and digitization of processes give rise to a networked organization that forms a living system. In this organization, the remaining manual tasks are fully transferred to global business services as well as to shared resources, such as automation experts, project managers, or business process owners. The boundaries between functions and business units further diminish. Work becomes functionally agnostic, less focused on specific deliverables, and performed more dynamically and iteratively. The end-to-end optimization and digitization of processes give rise to a networked organization that forms a living system. An effective and inclusive organization consists of three elements:Bundles of cross-functional support that pool data, tools, and systems to fully own end-to-end processes and their outcomes.Expert functions (such as tax, treasury, and HR) that support the cross-functional bundlesfor example, in discussing the options or legal restrictions that need be considered.Business partners that support the business leaders and other leaders (from the corporate level to local affiliates) by not only providing an appropriate answer, but also asking the right questions.Responsibilities Beyond Core TopicsThe networked organization makes it possible for the finance function to extend its responsibilities into adjacent topics previously managed by other support functions. This enhances the finance functions ability to steer performance holistically and promote optimal outcomes.Among the expanded responsibilities, we see four topics as especially important:Building a bridge to regulators and government authorities to actively optimize regulations and tariffs.Serving as an incubator of finance applications or supporting new business models with financial expertise.Taking an active role in co-creating a companys technology agenda, ensuring that business needs are addressed.Working with new types of stakeholders (such as kick-starter funding platforms) to develop new approaches to raising capital. Cryptocurrencies exemplify the opportunities relating to technology and innovative funding approaches. (See Finance Functions Should Lead Cryptocurrency Adoption.) Finance Functions Should Lead Cryptocurrency Adoption Cryptocurrencies, issued and maintained using blockchains, are fundamentally changing how we conduct business, pay for goods and services, and think about financing. Although cryptocurrencies have existed for years, the business and regulatory environments have only recently evolved to enable business models beyond financial speculation. Even central banks, which had been among the most vocal opponents, have started to consider using cryptocurrencies in their operating models.Finance functions should take the lead in managing their companies adoption of cryptocurrencies in new business models as well as in transactions along the value chain. Cryptocurrencies allow transactions and payments to occur simultaneously, eliminating the delays that are common today.",
        "https://www.bcg.com/publications/2021/the-future-of-finance-organizations"
    ],
    [
        0.4208040237426758,
        "In 2020, Roche had a market cap of CHF ~300 billion, invested CHF 12.2 billion in R&D and posted sales of CHF 58.3 billion. About the Center for CFO Excellence The Center for CFO Excellence (CFOx) is the hub of BCGs know-how and global expertise on the CFO domain. CFOx supports CFOs, helping them deal effectively with todays most pressing finance-related challenges. Our experts work with CFOs worldwide to support their efforts in transforming the finance functions operating model to achieve higher efficiency and effectiveness. They achieve this by capitalizing on the digital disruption to unleash the power of advanced analytics and artificial intelligence, also advancing corporate performance management to the next level and enhancing the value of the finance function.They focus on improving capital allocation to ensure a productive return on investments and to outperform competitors. Aiming to orchestrate company-wide transformations, BCG helps drive the corporate value agenda, identifying the best strategy for renewing the organizations finance systems and increasing transparency and insight. If you would like to learn more about CFOx, please contact one of the BCG authors or visit cfox.bcg.com. Authors Alan Hippe Chief Financial and Information Officer, Roche Alexander Roos Managing Director & Senior Partner; Global Leader, Center for CFO Excellence Berlin Anna Oberauer Partner Munich ABOUT BOSTON CONSULTING GROUPBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we work closely with clients to embrace a transformational approach aimed at benefiting all stakeholdersempowering organizations to grow, build sustainable competitive advantage, and drive positive societal impact.Our diverse, global teams bring deep industry and functional expertise and a range of perspectives that question the status quo and spark change. BCG delivers solutions through leading-edge management consulting, technology and design, and corporate and digital ventures. We work in a uniquely collaborative model across the firm and throughout all levels of the client organization, fueled by the goal of helping our clients thrive and enabling them to make the world a better place. Boston Consulting Group 2024. All rights reserved.For information or permission to reprint, please contact BCG at permissions@bcg.com. To find the latest BCG content and register to receive e-alerts on this topic or others, please visit bcg.com. Follow Boston Consulting Group on Facebook and X (formerly Twitter). Perspectives on Strategy and Value: Insights on creating sustainable value in an uncertain world. Subscribe Subscribed Click to Manage Your Subscriptions. Perspectives on Strategy and Value: Insights on creating sustainable value in an uncertain world. Subscribe Subscribed Click to Manage Your Subscriptions. Follow Us Global | EN Global | EN Japan | JA  2024 Boston Consulting Group Careers Contact Subscribe Alumni About Offices Privacy Policy Terms of Use Sitemap Responsible Disclosure Boston Consulting Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, sexual orientation, gender identity / expression, national origin, protected veteran status, or any other characteristic protected under federal, state or local law, where applicable, and those with criminal histories will be considered in a manner consistent with applicable state and local laws.Pursuant to Transparency in Coverage final rules (85 FR 72158) set forth in the United States by The Departments of the Treasury, Labor, and Health and Human Services click here to access required Machine Readable Files or here to access the Federal No Surprises Bill Act Disclosure.",
        "https://www.bcg.com/publications/2021/the-future-of-finance-organizations"
    ]
]